import React from "react";
import style from "./Features.module.css";
import Container from "../Container/Container";
import Icons from "../Icons/Icons";

const ColBox = ({ head, p, pathI, vB }) => {
  return (
    <div className={style.boxFeature}>
      <div className={style.boxImg}>
        <Icons path={pathI} viewBox={vB} />
      </div>
      <div className={style.childBox}>
        <h4>{head}</h4>
        <p>{p}</p>
      </div>
    </div>
  );
};

const Features = () => {
  return (
    <div className={style.parent}>
      <div className={style.child}>
        <Container>
          <span>لماذا سيَرٍتگ ؟</span>
          <h3> أكثر من مجرّد آداة لإنشاء السيرة</h3>
          <div className={style.parentCol}>
            <ColBox
              head="مجاني بالكامل"
              p="سيَرٍتگ هو موقع مجاني بالكامل, ولا تحتاج لدفع أموال للوصول الي المحتوي"
              pathI="M447.8,64H64c-23.6,0-42.7,19.1-42.7,42.7v63.9H64v-63.9h383.8v298.6H298.6V448H448c23.6,0,42.7-19.1,42.7-42.7V106.7 C490.7,83.1,471.4,64,447.8,64z M21.3,383.6L21.3,383.6l0,63.9h63.9C85.2,412.2,56.6,383.6,21.3,383.6L21.3,383.6z M21.3,298.6V341 c58.9,0,106.6,48.1,106.6,107h42.7C170.7,365.6,103.7,298.7,21.3,298.6z M213.4,448h42.7c-0.5-129.5-105.3-234.3-234.8-234.6l0,42.4 C127.3,255.6,213.3,342,213.4,448z"
              vB="0 0 512 512"
            />
            <ColBox
              head="أمكانية أنشاء أكثر من سيرة"
              p="يسمح لك موقع سيَرٍتگ بأن تنشيئ أكثر من سيرة وأدارتهم جميعا من حذف - تعديل - اختيار القالب"
              pathI="M447.8,64H64c-23.6,0-42.7,19.1-42.7,42.7v63.9H64v-63.9h383.8v298.6H298.6V448H448c23.6,0,42.7-19.1,42.7-42.7V106.7 C490.7,83.1,471.4,64,447.8,64z M21.3,383.6L21.3,383.6l0,63.9h63.9C85.2,412.2,56.6,383.6,21.3,383.6L21.3,383.6z M21.3,298.6V341 c58.9,0,106.6,48.1,106.6,107h42.7C170.7,365.6,103.7,298.7,21.3,298.6z M213.4,448h42.7c-0.5-129.5-105.3-234.3-234.8-234.6l0,42.4 C127.3,255.6,213.3,342,213.4,448z"
              vB="0 0 512 512"
            />
            <ColBox
              head="رابط دائم لسيرتك 📌"
              p="في عصر الإنترنت، لا أحد يذهب للتقديم على وظيفة بملف وعشرات المستندات، يكفي أن تُرسل رابط سيرتك الذاتية إلى مسؤول التوظيف وسيمكنه من الإطلاع سيرتك كاملة من أي جهاز وفي أي وقت."
              pathI="M364.2 83.8c-24.4-24.4-64-24.4-88.4 0l-184 184c-42.1 42.1-42.1 110.3 0 152.4s110.3 42.1 152.4 0l152-152c10.9-10.9 28.7-10.9 39.6 0s10.9 28.7 0 39.6l-152 152c-64 64-167.6 64-231.6 0s-64-167.6 0-231.6l184-184c46.3-46.3 121.3-46.3 167.6 0s46.3 121.3 0 167.6l-176 176c-28.6 28.6-75 28.6-103.6 0s-28.6-75 0-103.6l144-144c10.9-10.9 28.7-10.9 39.6 0s10.9 28.7 0 39.6l-144 144c-6.7 6.7-6.7 17.7 0 24.4s17.7 6.7 24.4 0l176-176c24.4-24.4 24.4-64 0-88.4z"
              vB="0 0 448 512"
            />
            <ColBox
              head="خصوصية عالية 🔒"
              p="يمكنك حماية سيرتك بكلمة مرور وبالتالي لن يستطيع أحد الإطلاع عليها إلا إن رغبت أنت بذلك."
              pathI="M144 144v48H304V144c0-44.2-35.8-80-80-80s-80 35.8-80 80zM80 192V144C80 64.5 144.5 0 224 0s144 64.5 144 144v48h16c35.3 0 64 28.7 64 64V448c0 35.3-28.7 64-64 64H64c-35.3 0-64-28.7-64-64V256c0-35.3 28.7-64 64-64H80z"
              vB="0 0 448 512"
            />
            <ColBox
              head="سهولة التحديث 🛵"
              p="أنت مضطر غالباً لتحديث بيانات سيرتك بإستمرار عند أي دورة جديدة حصلت عليها أو خبرة عملية أو حتى عند تغيير بيانات اتصالك، سيرة تجعل عملية تحديث سيرتك أسهل وأسرع."
              pathI="M471.6 21.7c-21.9-21.9-57.3-21.9-79.2 0L362.3 51.7l97.9 97.9 30.1-30.1c21.9-21.9 21.9-57.3 0-79.2L471.6 21.7zm-299.2 220c-6.1 6.1-10.8 13.6-13.5 21.9l-29.6 88.8c-2.9 8.6-.6 18.1 5.8 24.6s15.9 8.7 24.6 5.8l88.8-29.6c8.2-2.7 15.7-7.4 21.9-13.5L437.7 172.3 339.7 74.3 172.4 241.7zM96 64C43 64 0 107 0 160V416c0 53 43 96 96 96H352c53 0 96-43 96-96V320c0-17.7-14.3-32-32-32s-32 14.3-32 32v96c0 17.7-14.3 32-32 32H96c-17.7 0-32-14.3-32-32V160c0-17.7 14.3-32 32-32h96c17.7 0 32-14.3 32-32s-14.3-32-32-32H96z"
              vB="0 0 512 512"
            />
            <ColBox
              head="لغات متعددة 🇸🇦🏴󠁧󠁢󠁥󠁮󠁧󠁿🇫🇷"
              p="يمكنك كتابة سيرتك بأي عدد من اللغات، تظهر سيرتك لصاحب العمل بجميع اللغات المختارة."
              pathI="M0 128C0 92.7 28.7 64 64 64H256h48 16H576c35.3 0 64 28.7 64 64V384c0 35.3-28.7 64-64 64H320 304 256 64c-35.3 0-64-28.7-64-64V128zm320 0V384H576V128H320zM178.3 175.9c-3.2-7.2-10.4-11.9-18.3-11.9s-15.1 4.7-18.3 11.9l-64 144c-4.5 10.1 .1 21.9 10.2 26.4s21.9-.1 26.4-10.2l8.9-20.1h73.6l8.9 20.1c4.5 10.1 16.3 14.6 26.4 10.2s14.6-16.3 10.2-26.4l-64-144zM160 233.2L179 276H141l19-42.8zM448 164c11 0 20 9 20 20v4h44 16c11 0 20 9 20 20s-9 20-20 20h-2l-1.6 4.5c-8.9 24.4-22.4 46.6-39.6 65.4c.9 .6 1.8 1.1 2.7 1.6l18.9 11.3c9.5 5.7 12.5 18 6.9 27.4s-18 12.5-27.4 6.9l-18.9-11.3c-4.5-2.7-8.8-5.5-13.1-8.5c-10.6 7.5-21.9 14-34 19.4l-3.6 1.6c-10.1 4.5-21.9-.1-26.4-10.2s.1-21.9 10.2-26.4l3.6-1.6c6.4-2.9 12.6-6.1 18.5-9.8l-12.2-12.2c-7.8-7.8-7.8-20.5 0-28.3s20.5-7.8 28.3 0l14.6 14.6 .5 .5c12.4-13.1 22.5-28.3 29.8-45H448 376c-11 0-20-9-20-20s9-20 20-20h52v-4c0-11 9-20 20-20z"
              vB="0 0 640 512"
            />
            <ColBox
              head="قوالب وتصاميم متعددة 📐"
              p="يمكنك دائماً تغيير قالب سيرتك والحصول على سيرة ذاتية مختلفة تماماً ومميزة بدون أن تعيد كتابة أي حرف من بياناتك، أكتبها مرة وغير تصميمها عشرات المرات مستقبلاً."
              pathI="M32 119.4C12.9 108.4 0 87.7 0 64C0 28.7 28.7 0 64 0c23.7 0 44.4 12.9 55.4 32H456.6C467.6 12.9 488.3 0 512 0c35.3 0 64 28.7 64 64c0 23.7-12.9 44.4-32 55.4V392.6c19.1 11.1 32 31.7 32 55.4c0 35.3-28.7 64-64 64c-23.7 0-44.4-12.9-55.4-32H119.4c-11.1 19.1-31.7 32-55.4 32c-35.3 0-64-28.7-64-64c0-23.7 12.9-44.4 32-55.4V119.4zM456.6 96H119.4c-5.6 9.7-13.7 17.8-23.4 23.4V392.6c9.7 5.6 17.8 13.7 23.4 23.4H456.6c5.6-9.7 13.7-17.8 23.4-23.4V119.4c-9.7-5.6-17.8-13.7-23.4-23.4zM128 160c0-17.7 14.3-32 32-32H288c17.7 0 32 14.3 32 32v96c0 17.7-14.3 32-32 32H160c-17.7 0-32-14.3-32-32V160zM256 320h32c35.3 0 64-28.7 64-64V224h64c17.7 0 32 14.3 32 32v96c0 17.7-14.3 32-32 32H288c-17.7 0-32-14.3-32-32V320z"
              vB="0 0 576 512"
            />
            <ColBox
              head="سريع وعملي ⏱"
              p="سيرتك جاهزة للنشر خلال دقائق، لا تفوّت أي فرصة عمل بعد اليوم."
              pathI="M447.8,64H64c-23.6,0-42.7,19.1-42.7,42.7v63.9H64v-63.9h383.8v298.6H298.6V448H448c23.6,0,42.7-19.1,42.7-42.7V106.7 C490.7,83.1,471.4,64,447.8,64z M21.3,383.6L21.3,383.6l0,63.9h63.9C85.2,412.2,56.6,383.6,21.3,383.6L21.3,383.6z M21.3,298.6V341 c58.9,0,106.6,48.1,106.6,107h42.7C170.7,365.6,103.7,298.7,21.3,298.6z M213.4,448h42.7c-0.5-129.5-105.3-234.3-234.8-234.6l0,42.4 C127.3,255.6,213.3,342,213.4,448z"
              vB="0 0 512 512"
            />
          </div>
        </Container>
      </div>
    </div>
  );
};

export default Features;
